# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000
months = range(10)
count = 0
total_expenses = 0
inflation = 0.03

while len(months) >= count:
    total_expenses = (expenses - educational_grant) + total_expenses
    count += 1
    if count > 1:
        total_expenses = total_expenses * inflation + total_expenses
    continue
print(total_expenses)
