# -*- coding: utf-8 -*-
# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."
def add_buns():
    print('А теперь добавим булочку!')

def add_cutlet():
    print('А теперь добавим котлеты!')

def add_cucumber():
    print('А теперь добавим оугрец!')

def add_tomato():
    print('А теперь добавим помидор!')

def add_mayo():
    print('А теперь добавим майонез!')

def add_cheese():
    print('А теперь добавим сырочек!')

def add_salat():
    print('А теперь добавим салат!')

def add_sauce():
    print('А теперь добавим специальный соус!')

def add_bunss():
    print('А теперь добавим булочку с кунжутом!')