# -*- coding: utf-8 -*-
# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."
def buns():
    print('А теперь добавим булочку!')

def cutlet():
    print('А теперь добавим котлеты!')

def cucumber():
    print('А теперь добавим оугрец!')

def tomato():
    print('А теперь добавим помидор!')

def mayo():
    print('А теперь добавим майонез!')

def cheese():
    print('А теперь добавим сырочек!')

def salat():
    print('А теперь добавим салат!')

def sauce():
    print('А теперь добавим специальный соус!')

def bunss():
    print('А теперь добавим булочку с кунжутом!')